testing/MOM/pureBreakup/0/m2
// -*- C++ -*-
// File generated by PyFoam - sorry for the ugliness

FoamFile
{
 version 2.0;
 format ascii;
 class volScalarField;
 location "0";
 object m2;
}

dimensions [ 0 2 0 0 0 0 0 ];

internalField uniform 24;

boundaryField
{
  walls
  {
    type zeroGradient;
  }
} 	// ************************************************************************* //

