testing/MOM/pureBreakup/system/controlDict
// -*- C++ -*-
// File generated by PyFoam - sorry for the ugliness

FoamFile
{
 version 2.0;
 format ascii;
 class dictionary;
 location "system";
 object controlDict;
}

application twoPhaseEulerFoam;

startFrom startTime;

startTime 0;

stopAt endTime;

endTime 10;

deltaT 1e-4;

writeControl runTime;

writeInterval 10;

purgeWrite 0;

writeFormat binary;

writePrecision 6;

writeCompression compressed;

timeFormat general;

timePrecision 6;

runTimeModifiable yes;
adjustTimeStep no;
maxCo 0.5;

maxDeltaT 1;

libs
  (
    "libPBE.so"
  );

functions
{
  probes
  {
    functionObjectLibs
      (
        "libsampling.so"
      );
    type probes; 	// Name of the directory for probe data
    name probes; 	// Write at same frequency as fields
    outputControl timeStep;
    outputInterval 10; 	// Fields to be probed
    fields
      (
        n0
        n1
        n2
        n3
        n4
        n5
        n6
        n7
        n8
        n9
      );
    probeLocations
      (
        (0.5 0.5 0.5)
      ); 	// box centre
  }
} 	// ************************************************************************* //

